<template>
    <main class="lg:block relative bg-light-elevatedSurface dark:bg-dark-elevatedSurface transition-colors duration-300 ease-linear">
        <div>
            <div class="bg-light-elevatedSurface dark:bg-dark-elevatedSurface shadow-nuxt relative">
                <div class="container mx-auto px-4">
                    <div class="flex justify-between py-16 sm:py-24">
                        <div class="w-full lg:w-1/2 xl:w-6/12 text-center lg:text-left py-4 sm:p-0">
                            <h1 class="text-4xl xl:text-5xl text-light-onSurfacePrimary dark:text-dark-onSurfacePrimary font-medium tracking-normal leading-tight mb-6">
                                易于使用的 <br />
                                <span class="text-nuxt-lightgreen"> Vue </span> 框架
                            </h1>
                            <h2 class="xl:text-lg text-light-onSurfaceSecondary dark:text-dark-onSurfaceSecondary font-medium leading-relaxed mb-6">
                                使用 NuxtJS 充满信心地构建您的下一个 Vue.js 应用程序。 一个<span title="Under MIT license"> 开源 </span>框架，让 Web 开发变得简单而强大。
                            </h2>
                            <div class="flex flex-col sm:block py-4">
                                <a
                                    href="/docs/2.x/get-started/installation"
                                    class="no-underline inline-block font-medium text-sm px-4 py-2 shadow uppercase rounded hover:shadow-md sm:mr-4 py-3 px-6 text-base mb-4 primary"
                                >
                                    <div class="inline-block fill-current stroke-current mr-1">
                                        <svg
                                            xmlns="http://www.w3.org/2000/svg"
                                            aria-hidden="true"
                                            data-icon="meteor"
                                            data-prefix="fad"
                                            focusable="false"
                                            role="img"
                                            viewBox="0 0 512 512"
                                            class="svg-inline--fa fa-meteor fa-w-16 h-5 -mb-1 mr-1"
                                        >
                                            <g class="fa-group">
                                                <path
                                                    fill="currentColor"
                                                    d="M491.14.7C452.44 12.3 379.34 35 303.44 62c-2.1-7-4-13.5-5.6-18.6a16.06 16.06 0 0 0-20-10.69 16.6 16.6 0 0 0-2.86 1.19C232.54 56 122.14 116.5 60.54 176.4c-1.1 1-2.5 2-3.5 3C-19 255.5-19 378.87 57.09 455s199.48 76 275.55-.1c1-1 2-2.4 3-3.5C395.44 389.8 456 279.3 478.14 237a16.05 16.05 0 0 0-6.64-21.72 15.52 15.52 0 0 0-2.86-1.18c-5.2-1.6-11.6-3.5-18.6-5.6 27-76 49.7-149 61.3-187.7A16.17 16.17 0 0 0 491.14.7zM191.94 448a128 128 0 1 1 128-128 128 128 0 0 1-128 128z"
                                                    opacity=".4"
                                                    class="fa-secondary"
                                                ></path>
                                                <path
                                                    fill="currentColor"
                                                    d="M191.94 192a128 128 0 1 0 128 128 128 128 0 0 0-128-128zm-32 128a32 32 0 1 1 32-32 32 32 0 0 1-32 32zm48 64a16 16 0 1 1 16-16 16 16 0 0 1-16 16z"
                                                    class="fa-primary"
                                                ></path>
                                            </g>
                                        </svg>
                                    </div>
                                    开始使用
                                </a>
                                <a
                                    href="https://github.com/nuxt/nuxt.js"
                                    target="_blank"
                                    rel="noopener"
                                    data-cy="github-stars"
                                    class="no-underline inline-block font-medium text-sm px-4 py-2 shadow uppercase rounded hover:shadow-md sm:mr-4 py-3 px-6 text-base secondary"
                                >
                                    <div class="inline-block fill-current stroke-current mr-1 flex items-center">
                                        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 480 512" class="nui-svg nui-svg-gh inline-block h-6 -mt-1 mr-1">
                                            <path
                                                fill="currentColor"
                                                d="M186.1 328.7c0 20.9-10.9 55.1-36.7 55.1s-36.7-34.2-36.7-55.1 10.9-55.1 36.7-55.1 36.7 34.2 36.7 55.1zM480 278.2c0 31.9-3.2 65.7-17.5 95-37.9 76.6-142.1 74.8-216.7 74.8-75.8 0-186.2 2.7-225.6-74.8-14.6-29-20.2-63.1-20.2-95 0-41.9 13.9-81.5 41.5-113.6-5.2-15.8-7.7-32.4-7.7-48.8 0-21.5 4.9-32.3 14.6-51.8 45.3 0 74.3 9 108.8 36 29-6.9 58.8-10 88.7-10 27 0 54.2 2.9 80.4 9.2 34-26.7 63-35.2 107.8-35.2 9.8 19.5 14.6 30.3 14.6 51.8 0 16.4-2.6 32.7-7.7 48.2 27.5 32.4 39 72.3 39 114.2zm-64.3 50.5c0-43.9-26.7-82.6-73.5-82.6-18.9 0-37 3.4-56 6-14.9 2.3-29.8 3.2-45.1 3.2-15.2 0-30.1-.9-45.1-3.2-18.7-2.6-37-6-56-6-46.8 0-73.5 38.7-73.5 82.6 0 87.8 80.4 101.3 150.4 101.3h48.2c70.3 0 150.6-13.4 150.6-101.3zm-82.6-55.1c-25.8 0-36.7 34.2-36.7 55.1s10.9 55.1 36.7 55.1 36.7-34.2 36.7-55.1-10.9-55.1-36.7-55.1z"
                                            ></path>
                                        </svg>
                                    </div>
                                    34K+ github stars
                                </a>
                            </div>
                            <div data-cy="newsletter-link" class="flex flex-col sm:block text-light-onSurfaceSecondary dark:text-dark-onSurfaceSecondary">
                                <a href="#subscribe-to-newsletter" class="hover:text-light-onSurfacePrimary dark:hover:text-dark-onSurfacePrimary">
                                    每月获取 NuxtJS 更新到您的收件箱 💌
                                </a>
                            </div>
                        </div>
                        <figure data-cy="video" class="hidden lg:block lg:w-5/12">
                            <p class="font-medium py-2 text-xs xl:text-sm text-center text-light-onSurfaceSecondary dark:text-dark-onSurfaceSecondary">
                                由
                                <span
                                    ><a href="https://www.vuemastery.com" target="_blank" rel="noopener">
                                        Vue Mastery
                                    </a></span
                                >
                                制作的视频, 下载免费的
                                <span
                                    ><a href="https://www.vuemastery.com/nuxt-cheat-sheet/" target="_blank" rel="noopener">
                                        Nuxt 备忘单。
                                    </a></span
                                >
                            </p>
                        </figure>
                    </div>
                </div>
            </div>
            <div class="bg-light-surface dark:bg-dark-surface">
                <div class="container mx-auto px-4 pb-12">
                    <section class="rounded py-6 sm:p-6">
                        <h2 class="text-3xl font-medium pt-10 pb-8 text-center">
                            为什么选择 <span>Nuxt<span class="text-nuxt-lightgreen">JS</span></span>
                        </h2>
                        <div class="flex flex-col lg:flex-row items-start justify-between">
                            <div class="lg:w-1/3 px-4 py-8 lg:p-8 flex flex-col items-center">
                                <svg xmlns="http://www.w3.org/2000/svg" width="210" height="160" class="inline-block">
                                    <g fill="none" fill-rule="evenodd">
                                        <path
                                            fill="#E2E8F0"
                                            d="M201.408955 95.5223881c-.003653-39.0098851-23.727721-74.097893-59.92816-88.63403207C105.280355-7.64778306 63.8782777 1.28908618 36.8971119 29.4633268 9.91594605 57.6375675 2.77774752 99.3873675 18.8656716 134.925373H192.883582c5.633804-12.371237 8.541322-25.809347 8.525373-39.4029849z"
                                        ></path>
                                        <path stroke="#2F495E" stroke-linecap="round" stroke-linejoin="round" d="M11.558209 134.925373h186.268657M.8119403 134.925373h5.97014925M202.602985 134.925373h5.970149"></path>
                                        <g transform="translate(29.456716 18.316418)">
                                            <ellipse cx="136.49" cy="137.337" fill="#E2E8F0" rx="32.31" ry="3.869"></ellipse>
                                            <ellipse cx="33.087" cy="137.337" fill="#E2E8F0" rx="32.31" ry="3.869"></ellipse>
                                            <path
                                                fill="#FFF"
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M2.06567164 52.0119403H111.916418v60.1552237c0 2.466323-1.999349 4.465672-4.465672 4.465672H6.53134328c-1.18436975 0-2.32023081-.470489-3.1577067-1.307965-.83747588-.837476-1.30796494-1.973337-1.30796494-3.157707V52.0119403z"
                                            ></path>
                                            <path
                                                fill="#FFF"
                                                d="M7.05671642 36.6089552H106.949254c2.67468-.002481 4.875868 2.1039193 4.991045 4.7761194v10.5313433H2.08955224V41.3850746c.11476042-2.6629808 2.30173155-4.7658377 4.96716418-4.7761194z"
                                            ></path>
                                            <path
                                                fill="#2F495E"
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M7.05671642 36.6089552H106.949254c2.67468-.002481 4.875868 2.1039193 4.991045 4.7761194v10.5313433H2.08955224V41.3850746c.11476042-2.6629808 2.30173155-4.7658377 4.96716418-4.7761194z"
                                            ></path>
                                            <circle cx="9.803" cy="44.251" r="2.579" fill="#00C58E" stroke="#00C58E" stroke-linecap="round" stroke-linejoin="round"></circle>
                                            <circle cx="20.143" cy="44.251" r="2.579" fill="#FFF" stroke="#FFF" stroke-linecap="round" stroke-linejoin="round"></circle>
                                            <circle cx="30.484" cy="44.251" r="2.579" fill="#108775" stroke="#108775" stroke-linecap="round" stroke-linejoin="round"></circle>
                                            <path
                                                fill="#DAE1E9"
                                                stroke="#2F495E"
                                                stroke-linejoin="round"
                                                d="M13.9674102 106.92027363l23.76089858 23.76089859c.19526216.19526216.19526259.51184419 0 .70710678l-2.9571835 2.95718349c-.19526187.19526188-.5118446.19526216-.70710677 0l-23.7608986-23.7608986c-.19526213-.19526213-.19526187-.5118449 0-.70710677l2.9571835-2.9571835c.19526259-.19526258.51184464-.19526214.70710678 0zM39.120618 106.92721202l23.76089856 23.76089856c.19526216.19526216.19526188.5118449 0 .70710678l-2.9571842 2.9571842c-.19526188.19526188-.51184462.19526216-.70710678 0L35.45632702 110.591503c-.19526217-.19526217-.19526188-.5118449 0-.70710678l2.9571842-2.9571842c.19526188-.19526188.51184461-.19526217.70710678 0z"
                                            ></path>
                                            <path
                                                fill="#DAE1E9"
                                                stroke="#2F495E"
                                                stroke-linejoin="round"
                                                d="M37.73644274 110.55248524l-23.7608986 23.7608986c-.19526217.19526216-.5118449.19526188-.70710678 0l-2.9571842-2.9571842c-.19526188-.19526188-.19526216-.51184461 0-.70710678l23.7608986-23.7608986c.19526215-.19526214.5118449-.19526188.70710678 0l2.9571842 2.9571842c.19526188.19526188.19526214.51184463 0 .70710678z"
                                            ></path>
                                            <rect width="5.182" height="36.203" x="34.376" y="98.555" fill="#DAE1E9" stroke="#2F495E" stroke-linejoin="round" rx=".35"></rect>
                                            <rect width="5.182" height="36.203" x="8.513" y="98.555" fill="#DAE1E9" stroke="#2F495E" stroke-linejoin="round" rx=".35"></rect>
                                            <rect width="20.681" height="5.182" x="13.696" y="102.424" fill="#DAE1E9" stroke="#2F495E" stroke-linejoin="round" rx=".5"></rect>
                                            <rect width="27.152" height="31.021" x="11.116" y="61.063" fill="#00C58E" stroke="#2F495E" stroke-linejoin="round" rx="1"></rect>
                                            <path
                                                fill="#108775"
                                                stroke="#2F495E"
                                                stroke-linejoin="round"
                                                d="M58.7343284 99.8447761h37.8746268c1.318889 0 2.3880597 1.0691709 2.3880597 2.3880599v14.328358H56.3462687v-14.328358c0-1.318889 1.0691707-2.3880599 2.3880597-2.3880599z"
                                            ></path>
                                            <path fill="#FFF" stroke="#2F495E" stroke-linecap="round" stroke-linejoin="round" d="M56.3462687 86.9253731H98.997015v6.47164179H56.3462687z"></path>
                                            <path fill="#FFF" d="M120.298507 23.3791045l-3.080597 10.7701492h21.540299V23.3791045z"></path>
                                            <rect width="102.448" height="6.161" x="62.484" y="17.218" fill="#00C58E" stroke="#2F495E" stroke-linecap="round" stroke-linejoin="round" rx="1"></rect>
                                            <path fill="#00C58E" stroke="#2F495E" stroke-linecap="round" stroke-linejoin="round" d="M123.379104 40.3104478h12.3223881v93.9223881H123.379104z"></path>
                                            <path
                                                fill="#108775"
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M135.677612 17.2179104h-12.298508l4.919403-15.99999995c.197957-.48528036.669928-.80248172 1.19403-.80248172.524103 0 .996074.31720136 1.19403.80248172l4.991045 15.99999995z"
                                            ></path>
                                            <path stroke="#2F495E" stroke-linecap="round" stroke-linejoin="round" d="M65.0626866 17.2179104L129.707463 1.07462687M157.241791 17.2179104L129.707463 1.07462687"></path>
                                            <path
                                                fill="#108775"
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M118.602985 40.3104478h18.865672c.7122 0 1.289552-.5773522 1.289552-1.2895523v-4.8h-21.492537v4.7761194c-.006814.354574.132697.6963042.385714.9448029.253017.2484987.597205.3818302.951599.36863z"
                                            ></path>
                                            <path stroke="#2F495E" stroke-linecap="round" stroke-linejoin="round" d="M120.298507 23.3791045l-3.080597 10.7701492h21.540299V23.3791045z"></path>
                                            <path fill="#108775" stroke="#2F495E" stroke-linecap="round" stroke-linejoin="round" d="M71.7253731 23.3791045h12.3223881v6.16119403H71.7253731z"></path>
                                            <path
                                                fill="#FFF"
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M81.0626866 61.5641791c-.0000375 1.2481503-.753211 2.372929-1.9072858 2.8483138-1.1540747.4753847-2.4809469.2074153-3.3600817-.6785877-.8791347-.8860029-1.1367703-2.2149203-.6524189-3.3652607.4843513-1.1503403 1.6149572-1.894738 2.8630699-1.8850624 1.6920335.0131169 3.0567673 1.3885127 3.0567165 3.080597z"
                                            ></path>
                                            <path
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M123.379104 69.5402985l12.298508 12.3223881M135.677612 69.5402985l-12.298508 12.3223881M123.379104 83.3910448l12.298508 12.322388M135.677612 83.3910448l-12.298508 12.322388M123.379104 96.0477612l12.298508 12.3223878M135.677612 96.0477612l-12.298508 12.3223878M123.379104 108.991045l12.298508 12.298507M135.677612 108.991045l-12.298508 12.298507M123.379104 55.6895522l12.298508 12.3223881M135.677612 55.6895522l-12.298508 12.3223881M123.379104 41.838806l12.298508 12.322388M135.677612 41.838806l-12.298508 12.322388"
                                            ></path>
                                            <path
                                                fill="#2F495E"
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M159.438805 134.232836h-45.253731v-3.98806c0-.659444.534585-1.19403 1.19403-1.19403h42.865672c.659444 0 1.194029.534586 1.194029 1.19403v3.98806z"
                                            ></path>
                                            <path
                                                fill="#108775"
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M137.444776 129.050745h-16.716418v-3.988059c0-.659445.534585-1.19403 1.19403-1.19403h14.328358c.659444 0 1.19403.534585 1.19403 1.19403v3.988059z"
                                            ></path>
                                            <path fill="#FFF" stroke="#2F495E" stroke-linecap="round" stroke-linejoin="round" d="M156.83582 129.050745h-12.919403v-5.18208955h12.919403z"></path>
                                            <path
                                                fill="#FFF"
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M156.83582 123.892538h-12.919403v-5.18208955h12.919403zM156.83582 118.710448h-12.919403v-5.18208955h12.919403z"
                                            ></path>
                                            <path stroke="#2F495E" stroke-linecap="round" stroke-linejoin="round" d="M77.9820896 64.6447761l9.0507462 8.0477612H68.9552239z"></path>
                                            <path fill="#FFF" stroke="#2F495E" stroke-linecap="round" stroke-linejoin="round" d="M95.1283585 79.1641787H60.8597018v-6.47164179h34.2686567z"></path>
                                            <path stroke="#2F495E" stroke-linecap="round" stroke-linejoin="round" d="M77.9820896 58.4835821V29.5402985"></path>
                                        </g>
                                    </g>
                                </svg>
                                <h4 class="uppercase font-medium text-2xl py-8">
                                    模块化
                                </h4>
                                <p class="leading-loose text-light-onSurfaceSecondary dark:text-dark-onSurfaceSecondary">
                                    Nuxt 基于强大的模块化体系结构。您可以从 50 多个模块中进行选择，以使您的开发更快，更轻松。您无需重新发明轮子即可获得 PWA 好处，无需在页面上添加 Google Analytics 或生成站点地图。
                                </p>
                            </div>
                            <div class="lg:w-1/3 px-4 py-8 lg:p-8 flex flex-col items-center">
                                <svg xmlns="http://www.w3.org/2000/svg" width="206" height="160" class="inline-block">
                                    <g fill="none" fill-rule="evenodd">
                                        <path
                                            fill="#E2E8F0"
                                            d="M198.447059 94.1176471c-.0036-38.4362103-23.378784-73.0082181-59.046864-87.33059043C103.732115-7.53531566 62.9388912 1.27012903 36.3545073 29.0300426 9.77012331 56.7899562 2.73689829 97.9257886 18.5882353 132.941176H190.047059c5.550954-12.189307 8.415714-25.429797 8.4-38.8235289z"
                                        ></path>
                                        <path stroke="#2F495E" stroke-linecap="round" stroke-linejoin="round" d="M.8 132.941176h5.88235294M199.623529 132.941176h5.882353M11.3882353 132.941176H194.917647"></path>
                                        <g transform="translate(30.588235 54.117647)">
                                            <ellipse cx="54.188" cy="102.259" fill="#E2E8F0" rx="54.188" ry="2.635"></ellipse>
                                            <path
                                                fill="#FFF"
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M.47058824 15.1764706H108.705882v74.6029651c0 3.0586697-1.969947 5.5382114-4.4 5.5382114H4.87058824c-1.16695256 0-2.28610978-.5834885-3.11126984-1.6221046C.93415833 92.6569264.47058824 91.2482607.47058824 89.7794357V15.1764706z"
                                            ></path>
                                            <path
                                                fill="#FFF"
                                                d="M5.38823529 0H103.811765c2.635346-.00244452 4.804164 2.07297924 4.917647 4.70588235V15.0823529H.49411765V4.70588235C.6071904 2.08206302 2.7620002.01013052 5.38823529 0z"
                                            ></path>
                                            <path
                                                fill="#2F495E"
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M5.38823529 0H103.811765c2.635346-.00244452 4.804164 2.07297924 4.917647 4.70588235V15.0823529H.49411765V4.70588235C.6071904 2.08206302 2.7620002.01013052 5.38823529 0z"
                                            ></path>
                                            <circle cx="8.094" cy="7.529" r="2.541" fill="#00C58E" stroke="#00C58E" stroke-linecap="round" stroke-linejoin="round"></circle>
                                            <circle cx="18.282" cy="7.529" r="2.541" fill="#FFF" stroke="#FFF" stroke-linecap="round" stroke-linejoin="round"></circle>
                                            <circle cx="28.471" cy="7.529" r="2.541" fill="#108775" stroke="#108775" stroke-linecap="round" stroke-linejoin="round"></circle>
                                            <rect width="28.235" height="30.565" x="9.412" y="23.529" fill="#00C58E" stroke="#2F495E" stroke-linejoin="round" rx="1"></rect>
                                            <path
                                                fill="#108775"
                                                stroke="#2F495E"
                                                stroke-linejoin="round"
                                                d="M14.2862789 62.3058824H91.596074c2.6921199 0 4.8745142 2.1068952 4.8745142 4.7058823v28.2352941H9.41176471V67.0117647c0-2.5989871 2.18239429-4.7058823 4.87451419-4.7058823z"
                                            ></path>
                                            <path
                                                fill="#F5F7FA"
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M44.7058824 36.4705882h51.7647059v4.70588235H44.7058824zM44.7058824 49.4117647h51.7647059v4.70588235H44.7058824zM96.4705876 28.2352942H44.7058817v-4.70588235h51.7647059z"
                                            ></path>
                                        </g>
                                        <g transform="translate(94.917647 6.305882)">
                                            <path
                                                fill="#FFF"
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M60.99978944 64.61385912l5.96108843-5.921436 10.4319047 10.36251291-5.96108844 5.921436z"
                                            ></path>
                                            <ellipse
                                                cx="43.1"
                                                cy="42.398"
                                                fill="#DAE1E9"
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                rx="31.589"
                                                ry="31.465"
                                                transform="rotate(-26.88 43.100361 42.398194)"
                                            ></ellipse>
                                            <ellipse cx="43.108" cy="42.401" fill="#FFF" rx="25.309" ry="25.141"></ellipse>
                                            <path
                                                stroke="#2F495E"
                                                d="M61.0033613 24.6243902c7.2387094 7.1901248 9.4043406 18.0037886 5.48704 27.3984812-3.9173007 9.3946927-13.1460659 15.5202378-23.3828383 15.5202378s-19.4655376-6.1255451-23.3828382-15.5202378c-3.9173006-9.3946926-1.7516695-20.2083564 5.4870399-27.3984812 9.8879722-9.8072848 25.9036244-9.8072848 35.7915966 0z"
                                            ></path>
                                            <path
                                                fill="#00C58E"
                                                d="M98.06818425 94.4201091l-1.07157582 1.06519123c-2.16517688 2.15227637-5.6768479 2.15349405-7.84353695.00271967L69.78584982 76.26305308c-.72222966-.71692477-.72263858-1.87969568-.00091286-2.5971211l6.29877502-6.26124624c.72172572-.7174254 1.89228301-.71783097 2.61451267-.0009062l19.35414463 19.21198582c1.04621806 1.0316329 1.63593925 2.4345621 1.63890661 3.89891056.00296743 1.46434854-.58106312 2.86962471-1.62309164 3.90543319z"
                                            ></path>
                                            <path
                                                stroke="#2F495E"
                                                d="M69.77796693 73.66698954l6.38163689-6.33476299c.72222965-.71692477 1.89278666-.71651892 2.61451231.00090656l19.35370555 19.2383932c2.1651768 2.15227644 2.16395095 5.64058827-.00273823 7.79136236l-1.07232422 1.06444789c-2.16668847 2.1507748-5.67835979 2.14955698-7.8435366-.00271946L69.85551702 76.18622397c-.72172558-.71742555-.72131701-1.88019611.00091264-2.59712088l-.07846273.07788645z"
                                            ></path>
                                            <path
                                                fill="#2F495E"
                                                d="M28.6382715 41.8044233l5.3983193-5.3624104c.3928751-.3893154.6136703-.9179088.6136703-1.4691535s-.2207952-1.0798381-.6136703-1.4691535c-.3919225-.3902618-.9240555-.6095883-1.4789916-.6095883s-1.0870691.2193265-1.4789916.6095883l-6.3781513 6.3540889c-1.6241378 1.6195214-1.6241378 4.2387283 0 5.8582497l6.3781513 6.3357245c.3919225.3902618.9240555.6095883 1.4789916.6095883s1.0870691-.2193265 1.4789916-.6095883c.3917608-.3861725.6121038-.911728.6121038-1.4599713 0-.5482433-.220343-1.0737988-.6121038-1.4599713l-5.3983193-5.3624103c-.265352-.2589649-.4148226-.6129821-.4148226-.9824964 0-.3695144.1494706-.7235316.4148226-.9824964zM56.71283 41.8028672l-5.4168067-5.3624103c-.3928752-.3893155-.6136704-.9179088-.6136704-1.4691535 0-.5512448.2207952-1.0798381.6136704-1.4691536.3887585-.3891548.9178333-.6080322 1.4697479-.6080322.5519145 0 1.0809894.2188774 1.4697479.6080322l6.3966386 6.354089c1.6241379 1.6195214 1.6241379 4.2387282 0 5.8582496l-6.3781513 6.3357246c-.3887584.3891548-.9178333.6080322-1.4697479.6080322-.5519145 0-1.0809894-.2188774-1.4697478-.6080322-.3917608-.3861726-.6121039-.9117281-.6121039-1.4599713 0-.5482433.2203431-1.0737988.6121039-1.4599713l5.3983193-5.3807748c.2642732-.2557939.4133226-.6067834.4133226-.9733142 0-.3665308-.1490494-.7175203-.4133226-.9733142zM38.794958 54.6162944c-.5567522-.1763927-1.0189813-.5673023-1.2831026-1.0851268-.2641213-.5178244-.3080491-1.1192636-.1219394-1.669536l7.0991596-21.4680057c.3868112-1.1383583 1.62028-1.7591586 2.7731093-1.3956959.5567521.1763927 1.0189812.5673024 1.2831025 1.0851268.2641213.5178245.3080492 1.1192637.1219395 1.6695361l-7.0991597 21.4680057c-.1775739.5530487-.5711012 1.0122031-1.0923933 1.2745675-.521292.2623644-1.1267587.3060001-1.6807159.1211283z"
                                            ></path>
                                        </g>
                                    </g>
                                </svg>
                                <h4 class="uppercase font-medium text-2xl py-8">
                                    高效率
                                </h4>
                                <p class="leading-loose text-light-onSurfaceSecondary dark:text-dark-onSurfaceSecondary">
                                    借助 Nuxt.js，您的应用程序将得到开箱即用的优化。我们尽最大努力通过利用 Vue.js 和 Node.js 最佳实践来构建高性能应用程序。为了从应用程序中挤出所有不必要的内容，Nuxt
                                    包括捆绑分析器和许多微调您的应用程序的机会。
                                </p>
                            </div>
                            <div class="lg:w-1/3 px-4 py-8 lg:p-8 flex flex-col items-center">
                                <svg xmlns="http://www.w3.org/2000/svg" width="197" height="160" class="inline-block">
                                    <g fill="none" fill-rule="evenodd">
                                        <path
                                            fill="#E2E8F0"
                                            d="M189.674523 89.7867565c-.003434-36.6675407-22.302993-69.6486929-56.32978-83.31201107C99.3179548-7.18857274 60.4018603 1.21168314 35.0407757 27.6942045 9.67969115 54.1767259 2.97010499 93.4196636 18.0920314 126.823793H181.683502c5.277806-11.63343 8.002598-24.262382 7.991021-37.0370365z"
                                        ></path>
                                        <path stroke="#2F495E" stroke-linecap="round" stroke-linejoin="round" d="M11.2233446 126.801347H186.30752M1.12233446 126.801347h5.61167227M190.796857 126.801347h5.611673"></path>
                                        <g transform="translate(18.765432 7.542088)">
                                            <ellipse cx="24.108" cy="148.552" fill="#E2E8F0" rx="11.223" ry="3.367"></ellipse>
                                            <path
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M18.8776655 86.7340067c-.765013.7512771-1.1959666 1.7785065-1.1959666 2.8507296 0 1.072223.4309536 2.0994524 1.1959666 2.8507295l2.3569024 2.379349c1.5695374 1.5764314 1.5695374 4.1250276 0 5.7014592l-2.3569024 2.379349c-.765013.751277-1.1959666 1.778506-1.1959666 2.850729s.4309536 2.099453 1.1959666 2.85073M29.0909091 86.7340067c-1.5695375 1.5764315-1.5695375 4.1250276 0 5.7014591l2.3569023 2.379349c.7650131.7512771 1.1959667 1.7785065 1.1959667 2.8507295 0 1.0722231-.4309536 2.0994525-1.1959667 2.8507297l-2.3569023 2.379349c-1.5695375 1.576431-1.5695375 4.125028 0 5.701459"
                                            ></path>
                                            <path
                                                fill="#00C58E"
                                                stroke="#2F495E"
                                                stroke-linejoin="round"
                                                d="M11.2682379 142.154882c-3.84932629 0-7.40625057-2.053591-9.33091378-5.387205-1.92466322-3.333614-1.92466322-7.440797 0-10.774411 1.92466321-3.333614 5.48158749-5.387206 9.33091378-5.387205v5.387205c-2.97527134 0-5.38720535 2.411934-5.38720535 5.387205 0 2.975272 2.41193401 5.387206 5.38720535 5.387206v5.387205z"
                                            ></path>
                                            <rect width="26.599" height="33.67" x="11.268" y="113.872" fill="#FFF" stroke="#2F495E" stroke-linejoin="round" rx="1.2"></rect>
                                            <path
                                                fill="#FFF"
                                                stroke="#4550E5"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M58.6756453 37.3512907v-5.6116723c0-12.3969641 10.0497251-22.44668911 22.4466892-22.44668911 12.396964 0 22.4466895 10.04972501 22.4466895 22.44668911v5.6116723c2.479392 0 4.489337 2.009945 4.489337 4.4893378 0 2.4793928-2.009945 4.4893378-4.489337 4.4893378h-.269361c-1.708014 10.9257067-11.118921 18.979711-22.1773285 18.979711-11.0584076 0-20.469315-8.0540043-22.1773289-18.979711h-.2693603c-2.4793928 0-4.4893378-2.009945-4.4893378-4.4893378 0-2.4793928 2.009945-4.4893378 4.4893378-4.4893378z"
                                            ></path>
                                            <path
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M58.6756453 37.3512907v-5.6116723c0-12.3969641 10.0497251-22.44668911 22.4466892-22.44668911 12.396964 0 22.4466895 10.04972501 22.4466895 22.44668911v5.6116723c2.479392 0 4.489337 2.009945 4.489337 4.4893378 0 2.4793928-2.009945 4.4893378-4.489337 4.4893378h-.269361c-1.708014 10.9257067-11.118921 18.979711-22.1773285 18.979711-11.0584076 0-20.469315-8.0540043-22.1773289-18.979711h-.2693603c-2.4793928 0-4.4893378-2.009945-4.4893378-4.4893378 0-2.4793928 2.009945-4.4893378 4.4893378-4.4893378z"
                                            ></path>
                                            <circle cx="94.029" cy="46.869" r="2.806" fill="#DAE1E9"></circle>
                                            <circle cx="68.215" cy="46.869" r="2.806" fill="#DAE1E9"></circle>
                                            <path stroke="#4550E5" stroke-linecap="round" stroke-linejoin="round" d="M87.8787879 52.5701459c-3.77558 3.5801117-9.6924335 3.5801117-13.4680135 0"></path>
                                            <path
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M68.7766554 39.5959596c.5742368-1.3503252 1.89965-2.2269649 3.3670034-2.2269649 1.4673534 0 2.7927666.8766397 3.3670034 2.2269649M86.7340067 39.5959596c.5742368-1.3503252 1.89965-2.2269649 3.3670034-2.2269649 1.4673534 0 2.7927666.8766397 3.3670034 2.2269649"
                                            ></path>
                                            <path
                                                stroke="#4550E5"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M102.671156 99.9775533V98.630752M59.5735129 107.138047v-8.507295M102.671156 107.138047v-8.507295"
                                            ></path>
                                            <path
                                                fill="#108775"
                                                d="M102.671156 107.138047h11.223345c1.239696 0 2.244668-1.004972 2.244668-2.244669v-2.693602c0-19.3392644-15.677571-35.0168355-35.0168345-35.0168355-19.339264 0-35.0168351 15.6775711-35.0168351 35.0168355v2.693602c0 1.239697 1.0049725 2.244669 2.244669 2.244669h11.2233445v12.121212h43.0976431v-12.121212z"
                                            ></path>
                                            <path stroke="#2F495E" stroke-linejoin="round" d="M81.1223345 67.1829405v52.0763185"></path>
                                            <path
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M59.5735129 107.138047v-8.507295M102.671156 107.138047v-8.507295M102.671156 107.138047h11.223345c1.239696 0 2.244668-1.004972 2.244668-2.244669v-2.693602c0-19.3392644-15.677571-35.0168355-35.0168345-35.0168355-19.339264 0-35.0168351 15.6775711-35.0168351 35.0168355v2.693602c0 1.239697 1.0049725 2.244669 2.244669 2.244669h11.2233445v12.121212h43.0976431v-12.121212z"
                                            ></path>
                                            <circle cx="104.983" cy="81.549" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="98.249" cy="88.283" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="104.983" cy="95.017" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="98.249" cy="101.751" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="98.249" cy="115.219" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="91.515" cy="95.017" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="84.781" cy="101.751" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="91.515" cy="108.485" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="84.781" cy="115.219" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="71.313" cy="101.751" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="78.047" cy="108.485" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="71.313" cy="115.219" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="57.845" cy="88.283" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="64.579" cy="95.017" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="64.579" cy="108.485" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <circle cx="51.111" cy="95.017" r="1.347" fill="#FFF" opacity=".6"></circle>
                                            <path
                                                fill="#FFF"
                                                stroke="#2F495E"
                                                stroke-linejoin="round"
                                                d="M88.013468 136.767677c0-1.428776-.5675789-2.799033-1.5778759-3.80933s-2.3805538-1.577876-3.8093295-1.577876h-9.5847362c-7.003367 0-13.4680135-2.446689-13.4680135-20.20202v-4.040404H48.7991021v4.040404c0 25.611672 13.1762065 30.976431 24.2424243 30.976431h9.5847362c1.4306062.005999 2.8043509-.559654 3.8159511-1.571254 1.0116002-1.0116 1.5772527-2.385345 1.5712543-3.815951zM136.520763 131.380471h-9.607183c-7.003367 0-13.468013-2.446689-13.468013-20.20202v-4.040404h-10.774411v4.040404c0 25.611672 13.176207 30.976431 24.242424 30.976431h9.607183c2.975272 0 5.387206-2.411934 5.387206-5.387205 0-2.975272-2.411934-5.387206-5.387206-5.387206z"
                                            ></path>
                                            <path
                                                fill="#2F495E"
                                                d="M64.7362514 22.962963c6.7340067 1.3468013 21.3468013 4.6464646 35.9147026-1.3468014 12.547699-27.90123455-45.5218855-28.91133556-52.0763188-1.1672278-.1481997.6398229-.0087515 1.3124551.3815938 1.8406285.3951843.5432282 1.0128939.8809094 1.6835016.9203142 8.2828283.4489338 8.664422 21.3468014 7.2278339 30.7295174C53.3782267 83.1200898 73.28844 84.691358 81.1447811 100.40404c8.1930416-16.3860826 29.5398429-17.3063969 22.4466889-50.4152633-.24642-1.350618-.24642-2.7346795 0-4.0852975 1.481482-9.1133557 4.242425-24.2648709-3.030303-24.2648709l-1.3243544.5387205c.3815937 4.4893379 5.7912454 41.1223345-18.338945 42.6487094C56.7676768 66.352413 60.9203143 22.962963 64.7362514 22.962963z"
                                            ></path>
                                            <path
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M64.7362514 22.962963c6.7340067 1.3468013 21.3468013 4.6464646 35.9147026-1.3468014 12.547699-27.90123455-45.5218855-28.91133556-52.0763188-1.1672278-.1481997.6398229-.0087515 1.3124551.3815938 1.8406285.3951843.5432282 1.0128939.8809094 1.6835016.9203142 8.2828283.4489338 8.664422 21.3468014 7.2278339 30.7295174C53.3782267 83.1200898 73.28844 84.691358 81.1447811 100.40404c8.1930416-16.3860826 29.5398429-17.3063969 22.4466889-50.4152633-.24642-1.350618-.24642-2.7346795 0-4.0852975 1.481482-9.1133557 4.242425-24.2648709-3.030303-24.2648709l-1.3243544.5387205c.3815937 4.4893379 5.7912454 41.1223345-18.338945 42.6487094C56.7676768 66.352413 60.9203143 22.962963 64.7362514 22.962963z"
                                            ></path>
                                            <path
                                                fill="#00C58E"
                                                stroke="#2F495E"
                                                stroke-linecap="round"
                                                stroke-linejoin="round"
                                                d="M112.637486 52.4130191c-.586048-.0280066-1.133408.292479-1.395795.817254-.262388.524775-.19036 1.1549544.183674 1.6069884.792087.7912038 1.042914 1.9751653.639716 3.019596-.403199 1.0444307-1.384525 1.7527235-2.502791 1.8064422-7.115601 1.2570146-22.8282833-12.0763188-28.6644224-8.4175085-5.8361392-3.6588103-21.6161617 9.6745231-28.6195287 8.4175085-1.1182661-.0537187-2.0995921-.7620115-2.5027909-1.8064422-.4031989-1.0444307-.152371-2.2283922.6397157-3.019596.3812073-.4582205.4506762-1.1002759.1763006-1.629429-.2743757-.529153-.839155-.842339-1.4333151-.7948134-5.993266.3142536-6.1728395 14.2985409 8.6195286 13.647587 9.8540965-.4264871 18.7429854-4.4893379 23.1200898-10.7744108 4.4893378 6.2401796 13.2659932 10.3479237 23.1200894 10.7744108 14.792368.6509539 14.612795-13.3333334 8.619529-13.647587z"
                                            ></path>
                                            <ellipse cx="112.211" cy="146.442" fill="#E2E8F0" rx="43.3" ry="3.367"></ellipse>
                                            <path
                                                fill="#DAE1E9"
                                                stroke="#2F495E"
                                                stroke-linejoin="round"
                                                d="M101.481481 137.373737h-6.105499l13.041526-40.40404c.361013-1.1343097 1.413446-1.9054892 2.603816-1.9079686h4.130191l-13.670034 42.3120086z"
                                            ></path>
                                            <path
                                                fill="#DAE1E9"
                                                d="M154.747475 137.373737h-53.265994l13.670034-42.356902h49.382716c.883996-.0035681 1.717126.4129968 2.244669 1.1223345.513207.706763.655204 1.6172115.381594 2.4466891l-12.413019 38.7878784z"
                                            ></path>
                                            <path
                                                fill="#DAE1E9"
                                                stroke="#2F495E"
                                                stroke-linejoin="round"
                                                d="M154.747521 137.373737H98.7654321v6.734007h50.5274969c1.450533.000012 2.841331-.577742 3.864904-1.605527 1.023574-1.027786 1.595611-2.420944 1.589642-3.871465l.000046-1.257015z"
                                            ></path>
                                            <path
                                                fill="#DAE1E9"
                                                stroke="#2F495E"
                                                stroke-linejoin="round"
                                                d="M98.7654321 137.373737h-24.691358c-.3610672-.006018-.7094263.133215-.9668763.386445-.25745.253229-.4024219.599239-.4023718.960357-.0059692 1.45052.5660682 2.843679 1.5896416 3.871465 1.0235734 1.027785 2.4143709 1.605539 3.8649039 1.605527h20.6285073l-.0224467-6.823794z"
                                            ></path>
                                            <path
                                                stroke="#2F495E"
                                                stroke-linejoin="round"
                                                d="M154.747475 137.373737h-53.265994l13.670034-42.356902h49.382716c.883996-.0035681 1.717126.4129968 2.244669 1.1223345.513207.706763.655204 1.6172115.381594 2.4466891l-12.413019 38.7878784z"
                                            ></path>
                                        </g>
                                        <g>
                                            <path
                                                d="M35.35353491 145.9034794h4.548474c.02602192-.1954291.08163042-.3843097.16437852-.5583302l4.26582317-8.49297378-2.2191101-4.41670951-6.75956559 13.46801349zM48.8928948 145.9034794h2.1733225l-5.7049715-11.22334458-1.0290352 2.03830493 4.3713417 8.61845995c.0931624.1745186.1573117.3664762.1893425.5665797z"
                                            ></path>
                                            <path d="M44.3333649 136.92480373l-4.49049217 8.97867567h8.97867567z"></path>
                                            <path
                                                fill="#00C58E"
                                                d="M39.18189992 145.372303c-.01480806-.0277696-.02799611-.0564762-.03948988-.085958-.07972053-.1955801-.1042665-.4114737-.07066608-.6215425h-4.71592205l7.00841302-13.07884097 2.30080467 4.28908401.667171-1.25190119-2.00566985-3.74688737c-.05611718-.10799851-.39489871-.68545998-.97893313-.68545998-.26395862 0-.64223002.12122283-.94983534.69427619l-7.09986325 13.23753271c-.06027402.1146106-.35333044.7163167-.06235243 1.2496971.13301851.2424456.41568286.5311764 1.03920715.5311764h5.94634332c-.61936747 0-.90618864-.2843227-1.03920715-.5311764z"
                                            ></path>
                                            <path
                                                fill="#108775"
                                                d="M53.093454 144.1101117l-5.9982464-10.97549875c-.0619698-.11541475-.4081457-.69914704-1.0107483-.69914704-.2713849 0-.6602986.11985378-.9765582.69692753l-.7756905 1.41161117.690215 1.26068418 1.0684443-1.96427025 5.9341398 10.81569376h-2.2565544c.028875.1787987.0126788.3623171-.0470116.5326834-.012571.0376133-.0283021.0740055-.0470115.1087562l-.019232.0399513c-.3034382.5371225-.959463.5659762-1.0876763.5659762h3.53014c.1303502 0 .7842382-.0288537 1.0876764-.5659762.1346239-.2441466.2307839-.6547567-.0918863-1.2273915z"
                                            ></path>
                                            <path
                                                fill="#2F495E"
                                                fill-rule="nonzero"
                                                d="M49.8126341 145.3442858l.019847-.0394725c.0193077-.0343343.0355419-.0702904.048515-.1074529.0615992-.1683247.0783134-.3496438.0485149-.5262999-.034321-.1905245-.1030571-.373293-.2028807-.5394573l-4.6905147-8.20589204-.7166983-1.24557634-.7122878 1.24557634-4.68830949 8.20589204c-.09102901.1681382-.15220247.3506342-.18082849.5394573-.03773233.2083741-.01398911.4231552.06836199.6184024.01219504.0293329.02618774.0578944.04189928.0855237.14113444.2412208.44104511.5284928 1.10261276.5284928h8.73269305c.1389292 0 .8159335-.0285079 1.1290755-.5591936zm-5.4932168-8.1729983l4.2869584 7.499773h-8.57171158l4.28475318-7.499773z"
                                            ></path>
                                        </g>
                                        <path
                                            fill="#00C58E"
                                            fill-rule="nonzero"
                                            stroke="#2F495E"
                                            d="M156.330708 127.579281l-.01609.029488c-.255283.432632-.671283.567999-1.080969.567999h-5.030031c-.503969 0-.867443-.211412-1.069745-.557252-.027732-.051183-.027732-.051183-.050192-.102109-.085146-.201874-.109708-.42406-.07303-.625457.02515-.165896.078884-.326197.16437-.483822l2.700563-4.726763.842981-1.47412.434718.755512.413528.71869 2.696252 4.717235c.088707.147661.149814.310144.18129.485047.031604.187362.013876.379683-.048917.551107-.017171.049187-.038652.096764-.053296.121709l-.011432.022736z"
                                        ></path>
                                    </g>
                                </svg>
                                <h4 class="uppercase font-medium text-2xl py-8">
                                    令人愉快
                                </h4>
                                <p class="leading-loose text-light-onSurfaceSecondary dark:text-dark-onSurfaceSecondary">
                                    我们的主要重点是开发人员体验。我们喜欢 Nuxt.js，并且会不断改进框架，所以您也喜欢它！ 💚 <br />期待有吸引力的解决方案，描述性的错误消息，强大的默认值和详细的文档。
                                    如果有问题或疑问，我们有用的社区将为您提供帮助。
                                </p>
                            </div>
                        </div>
                        <div class="text-center">
                            <a
                                href="https://template.nuxtjs.org"
                                target="_blank"
                                rel="noopener"
                                data-cy="why"
                                class="no-underline inline-block font-medium text-sm px-4 py-2 shadow uppercase rounded hover:shadow-md py-3 px-6 text-base primary"
                                ><div class="inline-block fill-current stroke-current mr-1">
                                    <svg aria-label="CodeSandbox" viewBox="0 0 1024 1024" class="inline-block h-5 -mt-1 mr-1 align-middle">
                                        <g fill="currentColor">
                                            <path
                                                d="M719 851V639.85L902 533.8v211.47L719 851M302.08 643.44l-179.91-104.3v208.6l179.91 104.83V643.44M511.98 275.8l182.96-106.17L512.06 63 328.44 169.99l183.54 105.8"
                                            ></path>
                                        </g>
                                        <g fill="none" stroke="currentColor" stroke-width="80" stroke-miterlimit="10">
                                            <path d="M899 287.83L509 513v450M122.17 289L511.5 513"></path>
                                            <path d="M121 739.08l389.92 223.96L901 738.34V288L511 62 121 289z"></path>
                                        </g>
                                    </svg>
                                </div>
                                在线尝试 NuxtJS
                            </a>
                        </div>
                    </section>
                </div>
            </div>
            <div class="bg-light-surface dark:bg-dark-surface">
                <div class="container mx-auto px-4 pb-12">
                    <section class="rounded py-6 sm:p-6">
                        <h2 class="text-3xl text-center pt-10 font-medium">
                            <span>Nuxt<span class="text-nuxt-lightgreen">JS</span></span> 渲染
                        </h2>
                        <div class="flex flex-wrap">
                            <div class="lg:w-1/2 p-4 lg:p-8">
                                <svg
                                    xmlns="http://www.w3.org/2000/svg"
                                    aria-hidden="true"
                                    data-icon="fire-alt"
                                    data-prefix="fad"
                                    focusable="false"
                                    role="img"
                                    viewBox="0 0 448 512"
                                    class="svg-inline--fa fa-fire-alt fa-w-14 text-nuxt-green dark:text-nuxt-lightgreen mx-auto my-8 w-32"
                                >
                                    <g class="fa-group">
                                        <path
                                            fill="currentColor"
                                            d="M323.56 51.2a597.38 597.38 0 0 0-56.22 60C240.08 73.62 206.28 35.53 168 0 69.74 91.17 0 210 0 281.6 0 408.85 100.29 512 224 512s224-103.15 224-230.4c0-53.27-52-163.14-124.44-230.4zm-1.12 366.87A165.81 165.81 0 0 1 226.86 448c-43.93 0-84.43-14.89-114.06-41.92a146.18 146.18 0 0 1-35.88-50.39C68.35 335.82 64 314 64 290.75c0-59.43 42.8-106.39 104.3-180.12 30 34.59 18.49 19.78 100.7 124.59l62-70.74c24.32 40.25 27.78 45.59 34.84 59.1a157.93 157.93 0 0 1 15 104.62c-7.49 36.85-28.24 68.8-58.4 89.87z"
                                            opacity=".4"
                                            class="fa-secondary"
                                        ></path>
                                        <path
                                            fill="currentColor"
                                            d="M304.09 391.85A134.39 134.39 0 0 1 226.86 416C154.71 416 96 368.26 96 290.75c0-38.61 24.31-72.63 72.79-130.75 6.93 8 98.83 125.34 98.83 125.34l58.63-66.88c4.14 6.85 7.91 13.55 11.27 20 27.35 52.19 15.81 119-33.43 153.42z"
                                            class="fa-primary"
                                        ></path>
                                    </g>
                                </svg>
                                <h4 class="text-center uppercase text-2xl pt-8 pb-4 font-medium">
                                    服务器端渲染
                                </h4>
                                <p class="leading-loose text-left text-light-onSurfaceSecondary dark:text-dark-onSurfaceSecondary">
                                    这是 Nuxt 最受欢迎的模式。使用 SSR（也称为 "universal" 或 "isomorphic" 模式），将使用 Node.js 服务器将基于 Vue 组件的 HTML 传递给客户端，而不是纯 JavaScript。与传统的 Vue SPA
                                    相比，使用 SSR 将带来更大的 SEO 提升，更好的用户体验和更多的机会。<br />
                                    <br />由于单独实施 SSR 可能非常繁琐，因此 Nuxt.js 可为您提供全面的支持，并将处理常见的缺陷。
                                </p>
                            </div>
                            <div class="lg:w-1/2 p-4 lg:p-8">
                                <svg
                                    xmlns="http://www.w3.org/2000/svg"
                                    aria-hidden="true"
                                    data-icon="snowflake"
                                    data-prefix="fad"
                                    focusable="false"
                                    role="img"
                                    viewBox="0 0 448 512"
                                    class="svg-inline--fa fa-snowflake fa-w-14 mx-auto my-8 w-32"
                                >
                                    <g class="fa-group">
                                        <path
                                            fill="currentColor"
                                            d="M138.08 441.66a15.87 15.87 0 0 0 .16 22.44l11.3 11.3a16.06 16.06 0 0 0 22.6 0l19.7-19.7.06-67.86-53.66 53.66zM91.37 83.9l-14.9 4a15.46 15.46 0 0 0-10.9 18.9l7 26 56.67 32.74-19-70.74a15.47 15.47 0 0 0-18.87-10.9zM65.45 405.3a15.46 15.46 0 0 0 10.9 18.9l14.9 4a15.47 15.47 0 0 0 18.89-10.9l19-70.73-56.69 32.73zm355-167.2a15.48 15.48 0 0 0 18.9-10.9l4-14.9a15.47 15.47 0 0 0-10.9-18.9l-26-7-56.7 32.73zM8.67 227.2a15.47 15.47 0 0 0 18.9 10.9l70.77-19-56.72-32.8-25.95 7a15.51 15.51 0 0 0-11 19zm18.87 46.7a15.47 15.47 0 0 0-18.9 10.9l-4 14.9a15.46 15.46 0 0 0 10.9 18.9l26 7 56.76-32.71zm122.2-237.2L138.34 48a1.21 1.21 0 0 0-.16.16 15.87 15.87 0 0 0 .16 22.44L192 124.3V56.4l-19.7-19.7a16.06 16.06 0 0 0-22.56 0zm293.7 263.1l-4-14.9a15.48 15.48 0 0 0-18.9-10.9l-70.67 19 56.69 32.73 26-7a15.47 15.47 0 0 0 10.88-18.93zm-60.9-193a15.47 15.47 0 0 0-10.9-18.9l-14.9-4a15.45 15.45 0 0 0-18.9 10.9l-19 70.74 56.69-32.74zm-7 272.4l-56.67-32.73 19 70.73a15.46 15.46 0 0 0 18.89 10.9l14.9-4a15.47 15.47 0 0 0 10.9-18.9zM256 387.7l-.16 67.94 19.66 19.66a16.06 16.06 0 0 0 22.6 0l11.3-11.3a16.07 16.07 0 0 0 0-22.6zm42.4-351a16.06 16.06 0 0 0-22.6 0L256 56.4v67.9l53.71-53.7a16.07 16.07 0 0 0 0-22.6z"
                                            opacity=".4"
                                            class="fa-secondary"
                                        ></path>
                                        <path
                                            fill="currentColor"
                                            d="M446 366.05l-.09.15-15.47 26.8a15.42 15.42 0 0 1-21.06 5.72L256 310.2l-.2 185.8a16 16 0 0 1-16 16h-32a16 16 0 0 1-16-16l.1-185.7-153.25 88.5a15.51 15.51 0 0 1-21.1-5.7L2 366.3a15.51 15.51 0 0 1 5.7-21.1L162.16 256 7.87 166.8a15.43 15.43 0 0 1-5.73-21.06L17.67 119a15.41 15.41 0 0 1 21-5.72h.05L192 201.8V16a16 16 0 0 1 16-16h32a16 16 0 0 1 16 16v185.8l153.3-88.5a15.51 15.51 0 0 1 21.1 5.7l15.5 26.8a15.51 15.51 0 0 1-5.7 21.1L285.85 256l154.49 89.2a15.29 15.29 0 0 1 5.66 20.85z"
                                            class="fa-primary"
                                        ></path>
                                    </g>
                                </svg>
                                <h4 class="text-center uppercase text-2xl pt-8 pb-4 font-medium">
                                    静态生成
                                </h4>
                                <p class="leading-loose text-left text-light-onSurfaceSecondary dark:text-dark-onSurfaceSecondary">
                                    静态网站生成是当前非常热门的话题（又名 JAMStack）。与其切换到另一个框架并花时间去适应它，不如一石二鸟？
                                    <span class="text-gray-600">
                                        ( 🐦🐦)
                                    </span>
                                    <br /><br />
                                    Nuxt.js 支持根据您的 Vue 应用程序生成静态网站。它是 “两全其美” 的选择，因为您不需要服务器，但仍然拥有 SEO 的好处，因为 Nuxt 会预先渲染所有页面并包含必要的
                                    HTML。另外，您可以轻松地将结果页面部署到 Netlify 或 GitHub 页面。
                                </p>
                            </div>
                        </div>
                    </section>
                </div>
            </div>
        </div>
    </main>
</template>

<script>
export default {
    name: "PageMain",
}
</script>

<style scoped></style>
